12_Associations/starter_code/Rewsly_Associations/app/views/category/show.html.erb

SELECT "stories".* FROM "stories" INNER JOIN "categories_stories" ON "stories"."id" = "categories_stories"."story_id" WHERE "categories_stories"."category_id" = ?  [["category_id", 1]]
---
<ul>
	<% @category.stories.each do |story| %>