10_Forms/starter_code/ShirtsApp/app/controllers/shirts_controller.rb

  def create
    @shirt = Shirt.new(safe_shirt_params)
    if @shirt.save
---
INSERT INTO "shirts" ("created_at", "description", "image", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 06 Jan 2016 04:26:54 UTC +00:00], ["description", "this is my new shirt"], ["image", ""], ["name", "New Shirt"], ["updated_at", Wed, 06 Jan 2016 04:26:54 UTC +00:00]]