10_Forms/starter_code/MovieApp/app/controllers/movies_controller.rb

  def index
    @movies = Movie.all()
---
SELECT "movies".* FROM "movies"

    def load_movie
      @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]