13_Authentication/starter_code/Rewsly_Authentication/app/controllers/comments_controller.rb

INSERT INTO "comments" ("created_at", "post", "story_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 15 Jan 2016 02:56:29 UTC +00:00], ["post", "test"], ["story_id", 1], ["updated_at", Fri, 15 Jan 2016 02:56:29 UTC +00:00]]
---
  def create
    if user_signed_in?
      safe_comment = params.require(:comment).permit(:post).merge(story_id: params[:story_id])
      @comment = Comment.create(safe_comment)