11_Forms_Associations/starter_code/ShirtsApp/app/controllers/shirts_controller.rb

INSERT INTO "shirts" ("created_at", "description", "image", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 08 Jan 2016 02:39:39 UTC +00:00], ["description", ""], ["image", ""], ["name", ""], ["updated_at", Fri, 08 Jan 2016 02:39:39 UTC +00:00]]
---
  def create
    @shirt = Shirt.new(safe_shirt_params)
    if @shirt.save()

UPDATE "shirts" SET "name" = ?, "updated_at" = ? WHERE "shirts"."id" = 22  [["name", "MyNewShirt_updated"], ["updated_at", Fri, 08 Jan 2016 03:12:43 UTC +00:00]]
---
  def update
        # Don't need this line here
        # @shirt = Shirt.new(safe_shirt_params)
    if @shirt.update(safe_shirt_params)

SELECT "shirts".* FROM "shirts" WHERE (name LIKE '%%' OR description LIKE '%%')
---
  def load_shirt # private because this is a "helper" method and isn't "accessed" by user
    @shirt = Shirt.find(params[:id])